In [1]:
import pandas as pd
import numpy as np

In [1]:
x = []

max(x)

ValueError: max() arg is an empty sequence

In [3]:
df = pd.DataFrame(
    [
        ("bird", "Falconiformes", 389.0),
        ("bird", "Psittaciformes", 24.0),
        ("mammal", "Carnivora", 80.2),
        ("mammal", "Primates", np.nan),
        ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)



df

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [8]:
grouped = df.groupby("class")
grouped = df.groupby("order", axis="columns")
grouped = df.groupby(["class", "order"])

In [10]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df

     A      B         C         D
0  foo    one -1.910198  0.090209
1  bar    one -0.611319 -1.250209
2  foo    two -0.026311 -0.163620
3  bar  three  1.491793  0.274907
4  foo    two -0.379118 -0.916175
5  bar    two -0.051653  0.641222
6  foo    one -1.119278  0.772877
7  foo  three  0.990789 -0.689337

In [11]:
grouped = df.groupby("A")

grouped = df.groupby(["A", "B"])

In [13]:
df2 = df.set_index(["A", "B"])
grouped = df2.groupby(level=df2.index.names.difference(["B"]))

In [19]:
df2.index.names.difference(["A"])

FrozenList(['B'])

In [17]:
type(  df2.index.names.difference(["B"]) )

pandas.core.indexes.frozen.FrozenList

In [24]:
lst = [1, 2, 3, 1, 2, 4]

s = pd.Series([1, 2, 3, 10, 20, 30], lst)

grouped = s.groupby(level= 0)

grouped.first()

1     1
2     2
3     3
4    30
dtype: int64

In [25]:
df2 = pd.DataFrame({"X": ["B", "B", "A", "A"], "Y": [1, 2, 3, 4]})
df2

   X  Y
0  B  1
1  B  2
2  A  3
3  A  4

In [27]:
df3 = pd.DataFrame({"X": ["A", "B", "A", "B"], "Y": [1, 4, 3, 2]})
df3

   X  Y
0  A  1
1  B  4
2  A  3
3  B  2

In [28]:
df3.groupby(["X"]).get_group("A")

   X  Y
0  A  1
2  A  3

In [29]:
arrays = [['Falcon', 'Falcon', 'Parrot', 'Parrot'],
          ['Captive', 'Wild', 'Captive', 'Wild']]
index = pd.MultiIndex.from_arrays(arrays, names=('Animal', 'Type'))
df = pd.DataFrame({'Max Speed': [390., 350., 30., 20.]},
                  index=index)
df

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [31]:
grouped = df.groupby(level= 1)
grouped.sum()

         Max Speed
Type
Captive      420.0
Wild         370.0

In [32]:
type(grouped.groups)

pandas.io.formats.printing.PrettyDict

In [33]:
grouped.groups

{'Captive': [('Falcon', 'Captive'), ('Parrot', 'Captive')], 'Wild': [('Falcon', 'Wild'), ('Parrot', 'Wild')]}

In [34]:
grouped.head()

                Max Speed
Animal Type
Falcon Captive      390.0
       Wild         350.0
Parrot Captive       30.0
       Wild          20.0

In [36]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df

     A      B         C         D
0  foo    one  0.234721  1.849706
1  bar    one  1.035567 -0.049832
2  foo    two -0.850698  1.932270
3  bar  three -0.626824  0.045439
4  foo    two  0.438790 -1.722827
5  bar    two -0.073516 -1.640898
6  foo    one -0.445631 -1.357130
7  foo  three  0.798169  0.255082

In [38]:
grouped = df.groupby('A')
for name, group in grouped:
    print(name)
    print(group)

bar
     A      B         C         D
1  bar    one  1.035567 -0.049832
3  bar  three -0.626824  0.045439
5  bar    two -0.073516 -1.640898
foo
     A      B         C         D
0  foo    one  0.234721  1.849706
2  foo    two -0.850698  1.932270
4  foo    two  0.438790 -1.722827
6  foo    one -0.445631 -1.357130
7  foo  three  0.798169  0.255082

In [46]:
grouped = df.groupby(["A", "B"], as_index= True)

grouped.aggregate(np.sum)

                  C         D
A   B
bar one    1.035567 -0.049832
    three -0.626824  0.045439
    two   -0.073516 -1.640898
foo one   -0.210910  0.492576
    three  0.798169  0.255082
    two   -0.411909  0.209443

In [45]:
grouped = df.groupby(["A", "B"], as_index=False)

grouped.sum()

     A      B         C         D
0  bar    one  1.035567 -0.049832
1  bar  three -0.626824  0.045439
2  bar    two -0.073516 -1.640898
3  foo    one -0.210910  0.492576
4  foo  three  0.798169  0.255082
5  foo    two -0.411909  0.209443

In [48]:
def test(x):
    return x

grouped[["C", "D"]].agg([lambda x: test(x), np.mean, np.std])

                                                     C                      \
                                            <lambda_0>      mean       std
A   B
bar one                                       1.035567  1.035567       NaN
    three                                    -0.626824 -0.626824       NaN
    two                                      -0.073516 -0.073516       NaN
foo one    [0.23472088321448276, -0.44563107203438784] -0.105455  0.481081
    three                                     0.798169  0.798169       NaN
    two      [-0.8506984868953599, 0.4387895078219121] -0.205954  0.911806

                                                   D
                                          <lambda_0>      mean       std
A   B
bar one                                    -0.049832 -0.049832       NaN
    three                                   0.045439  0.045439       NaN
    two                                    -1.640898 -1.640898       NaN
foo one    [1.8497058933668606, -1.3571299896194715]  0.246288  2.267575
    three                                   0.255082  0.255082       NaN
    two     [1.932269583193529, -1.7228269873249074]  0.104721  2.584544

In [1]:
x = [3,2,1]
x.sort()

In [4]:
x = []
if not x:
    print("yes")

yes